#include "tests.h"

START_TEST(test_s21_is_less) {
  {
    // Разные мантисы, одинаковые знаки и степени
    s21_decimal a = {{123, 456, 11, 0b10000000000001101000000000000000}};
    s21_decimal b = {{123, 456, 21, 0b10000000000001101000000000000000}};
    ck_assert_int_eq((s21_is_less(a, b)), 0);
  }
  {
    // Числа одинаковые, степень одинаковая, оба отрицатеьные
    s21_decimal a = {{32, 1, 875640, MASK_MINUS}};
    s21_decimal b = {{32, 1, 875640, MASK_MINUS}};
    ck_assert_int_eq((s21_is_less(a, b)), 0);
  }
  {
    // Числа разные, но после нормализации 2е округляется, 30я степень
    s21_decimal a = {{123, 0, 0, 0b00000000000111000000000000000000}};
    s21_decimal b = {{12345, 0, 0, 0b00000000000111100000000000000000}};
    ck_assert_int_eq((s21_is_less(a, b)), 0);
  }
  {
    // Числа одинаковые но записаны по разному
    s21_decimal a = {{12, 0, 0, 0}};
    s21_decimal b = {{120000000, 0, 0, 0b00000000000001110000000000000000}};
    ck_assert_int_eq((s21_is_less(a, b)), 0);
  }
  {
    // Числа одинаковые но записаны по разному
    s21_decimal a = {{0, 2000, 0, 0b00000000000000110000000000000000}};
    s21_decimal b = {{0, 200, 0, 0b00000000000000100000000000000000}};
    ck_assert_int_eq((s21_is_less(a, b)), 0);
  }
  {
    // Числа одинаковые, степень одинаковая
    s21_decimal a = {{DEC_MAX}};
    s21_decimal b = {{DEC_MAX}};
    ck_assert_int_eq((s21_is_less(a, b)), 0);
  }
  {
    // Числа одинаковые, степень одинаковая
    s21_decimal a = {{DEC_ZERO}};
    s21_decimal b = {{DEC_ZERO}};
    ck_assert_int_eq((s21_is_less(a, b)), 0);
  }
  {
    // Числа одинаковые, степень одинаковая
    s21_decimal a = {{875, 41215, 12, MASK_MINUS}};
    s21_decimal b = {{875, 41215, 12, MASK_MINUS}};
    ck_assert_int_eq((s21_is_less(a, b)), 0);
  }
  {
    // Числа одинаковые, степень одинаковая
    s21_decimal a = {{65211, 90, 1313, 0b10000000000101000000000000000000}};
    s21_decimal b = {{65211, 90, 1313, 0b10000000000101000000000000000000}};
    ck_assert_int_eq((s21_is_less(a, b)), 0);
  }
  {
    // Числа одинаковые но записаны по разному
    // 1733237036125865400000000 ^ -8
    s21_decimal a = {{0b10000111000100101101111000000000,
                      0b11110111110011101101100100010110,
                      0b00000000000000010110111100000110,
                      0b00000000000010000000000000000000}};
    s21_decimal b = {{0b11110010011111111001001010011110,
                      0b00000000001111011001001110110010, 0,
                      0b00000000000000000000000000000000}};
    ck_assert_int_eq((s21_is_less(a, b)), 0);
  }
  {
    // Нули с разными знаками
    s21_decimal a = {{0, 0, 0, 0}};
    s21_decimal b = {{0, 0, 0, MASK_MINUS}};
    ck_assert_int_eq((s21_is_less(a, b)), 0);
  }
  {
    // Нули с разными степенями
    s21_decimal a = {{0, 0, 0, 0b00000000000011110000000000000000}};
    s21_decimal b = {{0, 0, 0, 0}};
    ck_assert_int_eq((s21_is_less(a, b)), 0);
  }
  {
    // Одинаковые мантисы, разные знаки, одна степень
    s21_decimal a = {{0, 987, 0, 0}};
    s21_decimal b = {{0, 987, 0, MASK_MINUS}};
    ck_assert_int_eq((s21_is_less(b, a)), 1);
  }
  {
    // Одинаковые мантисы, разный показатель степени
    s21_decimal a = {{3, 21, 123, 0}};
    s21_decimal b = {{3, 21, 123, 0b00000000000000010000000000000000}};
    ck_assert_int_eq((s21_is_less(b, a)), 1);
  }
  {
    // Разные мантисы (можно нормализовать), разный показатель степени
    s21_decimal a = {{0, 1000, 0, 0b00000000000000010000000000000000}};
    s21_decimal b = {{0, 2, 0, 0}};
    ck_assert_int_eq((s21_is_less(b, a)), 1);
  }

  {
    // Числа с разными мантисами, степень одинаковая, оба отрицательные
    s21_decimal a = {{1815, 0, 2, MASK_MINUS}};
    s21_decimal b = {{183, 0, 1, MASK_MINUS}};
    ck_assert_int_eq((s21_is_less(b, a)), 0);
  }
  {
    // Числа с разными мантисами, степень одинаковая, оба отрицательные
    s21_decimal a = {{21811, 0, 3131, 0b10000000000101000000000000000000}};
    s21_decimal b = {{21811, 11, 313, 0b10000000000101000000000000000000}};
    ck_assert_int_eq((s21_is_less(b, a)), 0);
  }
  {
    // Числа с разными мантисами, и степенями, оба отрицаьельные
    s21_decimal a = {{2112, 1, 313, 0b10000000000011000000000000000000}};
    s21_decimal b = {{211, 0, 313, 0b10000000000101000000000000000000}};
    ck_assert_int_eq((s21_is_less(a, b)), 1);
  }
  {
    // Нули с разными знаками
    s21_decimal a = {{0, 0, 0, MASK_MINUS}};
    s21_decimal b = {{0, 0, 0, 0b10000000000101000000000000000000}};
    ck_assert_int_eq((s21_is_less(b, a)), 0);
  }
  {
    // Мелкое число и 0
    s21_decimal a = {{1, 0, 0, 0b00000000000111000000000000000000}};
    s21_decimal b = {{DEC_ZERO}};
    ck_assert_int_eq((s21_is_less(b, a)), 1);
  }
}
END_TEST

Suite *is_less_suite(void) {
  Suite *s = suite_create("is_less");
  TCase *tc_core = tcase_create("core");

  tcase_add_test(tc_core, test_s21_is_less);
  suite_add_tcase(s, tc_core);

  return s;
}