#include "tests.h"

START_TEST(test_s21_is_greater) {
  {
    // Числа одинаковые, степень второго больше
    s21_decimal a = {{78464578, 0, 0, 0b00000000000111000000000000000000}};
    s21_decimal b = {{78464578, 0, 0, 0b00000000001111000000000000000000}};
    ck_assert_int_eq((s21_is_greater(a, b)), 0);
  }
  {
    // Числа разные, после нормализации 2е округляется
    s21_decimal a = {{981, 0, 0, 0b00000000000111000000000000000000}};
    s21_decimal b = {{9803, 0, 0, 0b00000000000111010000000000000000}};
    ck_assert_int_eq((s21_is_greater(a, b)), 0);
  }
  {
    // Разные числа одна степень
    s21_decimal a = {{44737488, 0, 0, 0b00000000000000010000000000000000}};
    s21_decimal b = {{37483, 0, 0, 0b00000000000000010000000000000000}};
    ck_assert_int_eq((s21_is_greater(a, b)), 1);
  }
  {
    // Разные числа одна степень, отрицателные
    s21_decimal a = {{94587387, 0, 0, 0b10000000000000010000000000000000}};
    s21_decimal b = {{844032, 0, 0, 0b10000000000000010000000000000000}};
    ck_assert_int_eq((s21_is_greater(a, b)), 0);
  }
  {
    // Числа одинаковые, разная степень
    s21_decimal a = {{0, 1, 0, 0b00000000000000110000000000000000}};
    s21_decimal b = {{0, 1, 0, 0b00000000000001010000000000000000}};
    ck_assert_int_eq((s21_is_greater(a, b)), 1);
  }
  {
    // Одинаковые числа с разными знаками
    s21_decimal a = {{4597, 3453, 34415, 0}};
    s21_decimal b = {{4597, 3453, 34415, MASK_MINUS}};
    ck_assert_int_eq((s21_is_greater(a, b)), 1);
  }
  {
    // Одинаковые числа и степени и знаки
    s21_decimal a = {{345789, 88654, 34234, MASK_MINUS}};
    s21_decimal b = {{345789, 88654, 34234, MASK_MINUS}};
    ck_assert_int_eq((s21_is_greater(a, b)), 0);
  }
  {
    // Числа разные, знаки тоже
    s21_decimal a = {{4352, 5443, 43543, 0}};
    s21_decimal b = {{757455, 21409, 903840, MASK_MINUS}};
    ck_assert_int_eq((s21_is_greater(a, b)), 1);
  }
  {
    // Разные числа и знаки
    s21_decimal a = {{DEC_MAX}};
    s21_decimal b = {{DEC_MIN}};
    ck_assert_int_eq((s21_is_greater(a, b)), 1);
  }
  {
    s21_decimal a = {{DEC_ZERO}};
    s21_decimal b = {{DEC_MIN}};
    ck_assert_int_eq((s21_is_greater(a, b)), 1);
  }
  {
    s21_decimal a = {{DEC_MAX}};
    s21_decimal b = {{DEC_ZERO}};
    ck_assert_int_eq((s21_is_greater(a, b)), 1);
  }
  {
    // 0.0000000000000000000000000001 и 0
    s21_decimal a = {{1, 0, 0, 0b00000000000111000000000000000000}};
    s21_decimal b = {{DEC_ZERO}};
    ck_assert_int_eq((s21_is_greater(a, b)), 1);
  }
  {
    // 0 и -0.0000000000000000000000000001
    s21_decimal a = {{DEC_ZERO}};
    s21_decimal b = {{1, 0, 0, 0b10000000000001110000000000000000}};
    ck_assert_int_eq((s21_is_greater(a, b)), 1);
  }
  {
    // Одинаковые мантисы, одинаковые знаки, разный показатель степени
    s21_decimal a = {{53, 2378, 923, 0b00000000000000110000000000000000}};
    s21_decimal b = {{53, 2378, 923, 0b00000000000000100000000000000000}};
    ck_assert_int_eq((s21_is_greater(a, b)), 0);
  }
  {
    // Разные мантисы, разные знаки, одинаковый показатель степени
    s21_decimal a = {{64544, 933, 2920, 0b00000000000000110000000000000000}};
    s21_decimal b = {{93443, 432, 9928, 0b00000000000000110000000000000000}};
    ck_assert_int_eq((s21_is_greater(a, b)), 0);
  }
  {
    // Одинаковые мантисы, оба отрицательные, разные показатели степени
    s21_decimal a = {{583999, 78822, 1239, 0b10000000000000110000000000000000}};
    s21_decimal b = {{583999, 78822, 1239, 0b10000000000100110000000000000000}};
    ck_assert_int_eq((s21_is_greater(a, b)), 0);
  }
  {
    // Первое отрицатеьлное второе положительное
    s21_decimal a = {{53, 4542, 421, 0b10000000000000110000000000000000}};
    s21_decimal b = {{654654, 24214, 4322, 0b00000000000100110000000000000000}};
    ck_assert_int_eq((s21_is_greater(a, b)), 0);
  }
  {
    // Одинаковые мантисы (можно нормализовать), разный показатель степени
    s21_decimal a = {{0, 10000, 0, 0b00000000000001110000000000000000}};
    s21_decimal b = {{0, 1, 0, 0}};
    ck_assert_int_eq((s21_is_greater(a, b)), 0);
  }
  {
    // Числа с разными мантисами, степень одинаковая, оба отрицательные
    s21_decimal a = {{897238, 0, 0, MASK_MINUS}};
    s21_decimal b = {{783, 0, 0, MASK_MINUS}};
    ck_assert_int_eq((s21_is_greater(a, b)), 0);
  }
  {
    // Числа с разными мантисами, степень одинаковая, оба отрицательные
    s21_decimal a = {{35, 4354, 53332, 0b10000000000101000000000000000000}};
    s21_decimal b = {{422, 23125, 42, 0b10000000000101000000000000000000}};
    ck_assert_int_eq((s21_is_greater(a, b)), 0);
  }
  {
    // Числа с разными мантисами, одинаковые степени, оба отрицательные
    s21_decimal a = {{3274899, 3, 93433, 0b10000000000101000000000000000000}};
    s21_decimal b = {{52343, 0, 6643, 0b00000000000101000000000000000000}};
    ck_assert_int_eq((s21_is_greater(a, b)), 0);
  }
  {
    // Одинаковые мантисы, разные знаки
    s21_decimal a = {{5345343, 0, 0, MASK_MINUS}};
    s21_decimal b = {{5345343, 0, 0, 0}};
    ck_assert_int_eq((s21_is_greater(a, b)), 0);
  }
  {
    // Одинаковые мантисы, разный показатель степени
    s21_decimal a = {{875674332, 0, 0, 0b00000000000000010000000000000000}};
    s21_decimal b = {{875674332, 0, 0, 0}};
    ck_assert_int_eq((s21_is_greater(a, b)), 0);
  }
  {
    // Одинаковые мантисы (можно нормализовать), разный показатель степени
    s21_decimal a = {{0, 1000, 0, 0b00000000000001110000000000000000}};
    s21_decimal b = {{0, 1, 0, 0}};
    ck_assert_int_eq((s21_is_greater(a, b)), 0);
  }
  {
    // Числа с разными мантисами, степень одинаковая, оба отрицательные
    s21_decimal a = {{3423, 10, 422, 0b10000000000101000000000000000000}};
    s21_decimal b = {{3423, 21, 422, 0b10000000000101000000000000000000}};
    ck_assert_int_eq((s21_is_greater(a, b)), 1);
  }
}
END_TEST

Suite *is_greater_suite(void) {
  Suite *s = suite_create("is_greater");
  TCase *tc_core = tcase_create("core");

  tcase_add_test(tc_core, test_s21_is_greater);
  suite_add_tcase(s, tc_core);

  return s;
}